import React from 'react';

import './FooterPanel.scss';

function FooterPanel() {

    return (
        <section className="footer">
            <div className="footer-content">
                <div className="footer-section">
                    <span className="footer-title">Aesthetic Furniture</span>
                    <span className="footer-description">- современная эстетика для вашего дома</span>
                </div>
                <div className="footer-section">
                    <span className="footer-description">здесь вы видите полезные ссылки</span>
                    <Telegram width="24" height="24" style={{ fill: '#193140' }} />
                    <Vk width="24" height="24" style={{ fill: '#193140' }} />
                    <WhatsappFill width="24" height="24" style={{ fill: '#193140' }} />
                </div>

            </div>
        </section>

    );
}
export default FooterPanel;

export const Telegram = (props) => (
    <div className="icon-footer">
        <svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 48 48" {...props}>
            <path  d="M41.42 7.309s3.885-1.515 3.56 2.164c-.107 1.515-1.078 6.818-1.834 12.553l-2.59 16.99s-.216 2.489-2.159 2.922c-1.942.432-4.856-1.515-5.396-1.948c-.432-.325-8.094-5.195-10.792-7.575c-.756-.65-1.62-1.948.108-3.463L33.648 18.13c1.295-1.298 2.59-4.328-2.806-.649l-15.11 10.28s-1.727 1.083-4.964.109l-7.016-2.165s-2.59-1.623 1.835-3.246c10.793-5.086 24.068-10.28 35.831-15.15Z"></path>
        </svg>
    </div>
);

export const Vk = (props) => (
    <div className="icon-footer">
        <svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 1024 640" {...props}>
            <path d="M772 323q65 48 158.5 139.5T1024 576q0 27-15.5 45.5T960 640H854q-30 0-54-25q-60-64-123-123t-101-84v200q0 13-9.5 22.5T544 640H416q-23 0-66.5-35T256 512q-72-83-164-242T0 64q0-35 15.5-49.5T64 0h106q14 0 29.5 12T223 40q2 5 20 42.5t23 47.5l21 42l24.5 46.5L334 256l26 39l24 29V32q0-13 9.5-22.5T416 0h128q13 0 22.5 9.5T576 32v228q102-69 224-235q8-10 23.5-17.5T854 0h106q35 0 49.5 16t14.5 48q0 44-81.5 122.5T772 323z"></path>
        </svg>
    </div>
)

export const WhatsappFill = (props) => (
    <div className="icon-footer">
        <svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 24 24" {...props}>
            <path d="M12.001 2c5.523 0 10 4.477 10 10s-4.477 10-10 10a9.954 9.954 0 0 1-5.03-1.355L2.005 22l1.352-4.968A9.953 9.953 0 0 1 2.001 12c0-5.523 4.477-10 10-10ZM8.593 7.3l-.2.008a.961.961 0 0 0-.372.1a1.293 1.293 0 0 0-.294.228c-.12.113-.188.211-.261.306A2.73 2.73 0 0 0 6.9 9.62c.002.49.13.967.33 1.413c.409.902 1.082 1.857 1.97 2.742c.214.213.424.427.65.626a9.448 9.448 0 0 0 3.84 2.046l.568.087c.185.01.37-.004.556-.013a1.99 1.99 0 0 0 .833-.231a4.83 4.83 0 0 0 .383-.22s.043-.028.125-.09c.135-.1.218-.171.33-.288c.083-.086.155-.187.21-.302c.078-.163.156-.474.188-.733c.024-.198.017-.306.014-.373c-.004-.107-.093-.218-.19-.265l-.582-.261s-.87-.379-1.402-.621a.497.497 0 0 0-.176-.041a.482.482 0 0 0-.378.127c-.005-.002-.072.055-.795.931a.35.35 0 0 1-.368.13a1.43 1.43 0 0 1-.191-.066c-.124-.052-.167-.072-.252-.108a6.025 6.025 0 0 1-1.575-1.003c-.126-.11-.243-.23-.363-.346a6.297 6.297 0 0 1-1.02-1.268l-.059-.095a.923.923 0 0 1-.102-.205c-.038-.147.061-.265.061-.265s.243-.266.356-.41c.11-.14.203-.276.263-.373c.118-.19.155-.385.093-.536c-.28-.684-.57-1.365-.868-2.041c-.059-.134-.234-.23-.393-.249c-.054-.006-.108-.012-.162-.016a3.385 3.385 0 0 0-.403.004l.201-.008Z"></path>
        </svg>
    </div>
)